Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Make your entities extend `PanacheMongoEntity`: it has an ID field that is auto-generated. If you require a custom ID strategy, you can extend `PanacheMongoEntityBase` instead and handle the ID yourself.
ja_jp: エンティティは `PanacheMongoEntity` を拡張するようにしてください：自動生成されるIDフィールドがあります。カスタムのID戦略が必要な場合は、代わりに `PanacheMongoEntityBase` を拡張して、IDを自分で処理することができます。

source: Making `MyWireMockResource` inject the `wireMockServer` field can be done as shown in the `inject` method of the following code snippet:
ja_jp: 次のコードスニペットの `inject` メソッドに示すように、 `MyWireMockResource` に `wireMockServer` フィールドを注入させることができます:

source: Manage Non-CDI Service
ja_jp: 非CDIサービスの管理

source: Manage push notification configurations per task
ja_jp: タスクごとのプッシュ通知設定の管理

source: Manage runtime-loaded WASM modules.
ja_jp: 実行時にロードされる WASM モジュールを管理します。

source: Manage your MongoDB schema migrations with Liquibase.
ja_jp: Liquibase を使ったMongoDBスキーマのマイグレーション

source: Managed beans implemented by a Java class
ja_jp: Java クラスによって実装されるマネージド Bean

source: Managed by the garbage collector.
ja_jp: ガベージコレクターによって管理されます。

source: Management Interface
ja_jp: マネジメントインターフェース

source: Management Interface Configuration
ja_jp: マネジメントインターフェイスの設定

source: Management beans are not working in GraalVM native images; therefore Hibernate's capability to register statistics and management operations with the JMX bean is disabled when compiling into a native image. This limitation is likely permanent, as it's not a goal for native images to implement support for JMX. All such metrics can be accessed in other ways.
ja_jp: マネージメントBeanはGraalVMのネイティブイメージでは動作しません。したがって、ネイティブイメージにコンパイルした場合、JMX Beanに統計や管理操作を登録するHibernateの機能は無効になります。ネイティブイメージがJMXのサポートを実装することが目標ではないため、この制限はおそらく永久的なものです。このようなメトリクスはすべて他の方法でアクセスできます。

source: Management beans are not working in GraalVM native images; therefore, Hibernate's capability to register statistics and management operations with the JMX bean is disabled when compiling into a native image. This limitation is likely permanent, as it's not a goal for native images to implement support for JMX. All such metrics can be accessed in other ways.
ja_jp: 管理 Bean は GraalVM ネイティブイメージでは動作しません。したがって、ネイティブイメージにコンパイルすると、JMX Bean に統計と管理操作を登録する Hibernate の機能は無効になります。ネイティブ・イメージがJMXのサポートを実装することは目標ではないので、この制限は永久に続くと思われます。このようなメトリクスはすべて、他の方法でアクセスすることができます。

source: Management endpoint
ja_jp: 管理エンドポイント

source: Management endpoints are configured differently than standard HTTP endpoints. They use a unique root path, which is `/q` by default. This management root path can be configured using the `quarkus.management.root-path property`. For example, if you want to expose the management endpoints under `/management` use:
ja_jp: マネジメントエンドポイントは、標準的な HTTP エンドポイントとは異なる設定になっています。ユニークなルートパスを使用し、デフォルトでは `/q` になっています。このマネジメントルートパスは、`quarkus.management.root-path property` を使用して設定することができます。たとえば、マネジメントエンドポイントを `/management` の下に公開したい場合、次を使用します。

source: Management endpoints can only be declared by extensions and not from the application code.
ja_jp: マネジメントエンドポイントは、エクステンションによってのみ宣言でき、アプリケーションコードからは宣言できません。

source: Management endpoints configured using a _relative_ path (not starting with `/`) will be served from the configured root path. For example, if the endpoint path is `health` and the root path is `management`, the resulting path is `/management/health`
ja_jp: _相対_ パス (`/` で始まらない) を使用して設定されたマネジメントエンドポイントは、設定されたルートパスから提供されます。たとえば、エンドポイントのパスが `health` で、ルートパスが `management` の場合、結果として `/management/health` のようなパスになります。

source: Management endpoints configured using an _absolute_ path (starting with `/`) will be served from the root. For example, if the endpoint path is `/health`, the resulting path is `/health`, regardless of the root path
ja_jp: _絶対_ パス (`/` で始まる) を使用して構成されたマネジメントエンドポイントは、ルートから提供されます。たとえば、エンドポイントのパスが `/health` の場合、ルートパスに関係なく、結果として `/health` になります。

source: Management interface
ja_jp: マネジメントインターフェース

source: Management interface configuration
ja_jp: マネジメントインターフェイスの設定

source: Management interface reference
ja_jp: マネジメントインターフェースリファレンス

source: Management network interface
ja_jp: 管理用ネットワークインターフェイス

source: Managing JWK keys
ja_jp: JWK キーの管理

source: Managing Proxy Classes
ja_jp: プロキシークラスの管理

source: Managing plugins
ja_jp: プラグインの管理

source: Managing registered clients
ja_jp: 登録クライアントの管理

source: Managing the transactions manually via `entityManager.getTransaction().begin()` and friends lead to a butt ugly code with tons of try catch finally that people get wrong. Transactions are also about JMS and other database access, so one API makes more sense.
ja_jp: `entityManager.getTransaction().begin()` やその類似を経由して手動でトランザクションを管理すると、最終的に人々が間違えるような試行回数の多い醜いコードになってしまいます。 トランザクションはまた、JMSと他のデータベースアクセスについてですので、単一のAPIはより多くの理にかなっています。

source: Managing transactions in the reactive programming world can be cumbersome. Instead of writing repetitive and complex (thus error-prone!) code, you can use the `io.vertx.mutiny.sqlclient.Pool#withTransaction` helper method.
ja_jp: リアクティブプログラミングの世界でトランザクションを管理するのは面倒な場合があります。反復的で複雑な (したがってエラーが発生しやすい) コードを記述する代わりに、 `io.vertx.mutiny.sqlclient.Pool#withTransaction` ヘルパーメソッドを使用できます。

source: Mandatory
ja_jp: 必須

source: Mandatory in the Gradle build to enable the generation of the files in the annotation based serialization
ja_jp: アノテーションベースのシリアライゼーションでファイル生成を有効にするため、Gradleビルドで必須です。

source: Mandrel 22.0.0 contains a bug where the symbolic links used by the import cypher file are not correctly set when generating reports within a container (for more details see link:https://github.com/oracle/graal/issues/4355[here]). This can be worked around by copying the following script into a file and executing it:
ja_jp: Mandrel 22.0.0 には、コンテナー内でレポートを生成する際に、インポートサイファーファイルで使用されるシンボリックリンクが正しく設定されないというバグが含まれています (詳細は link:https://github.com/oracle/graal/issues/4355[こちら] を参照)。これは、以下のスクリプトをファイルにコピーして実行することで回避できます。

source: Mandrel can produce further reports beyond the ones that are enabled with the `-Dquarkus.native.enable-reports` option. These are called expert options and you can learn more about them by running:
ja_jp: Mandrelは、 `-Dquarkus.native.enable-reports` オプションで有効になっているレポート以外にも、様々なレポートを作成することができます。これらはエキスパートオプションと呼ばれ、以下を実行することで詳細を知ることができます。

source: Mandrel is a downstream distribution of the Oracle GraalVM CE. Mandrel's main goal is to provide a way to build native executables specifically designed to support Quarkus.
ja_jp: Mandrelは、Oracle GraalVM CEのダウンストリームディストリビューションです。Mandrelの主な目的は、Quarkusをサポートするために特別に設計されたネイティブ実行可能ファイルを構築する方法を提供することです。

source: Mandrel is built slightly differently to Oracle GraalVM CE, using the standard OpenJDK project. This means that it does not profit from a few small enhancements that Oracle have added to the version of OpenJDK used to build their own GraalVM downloads. These enhancements are omitted because upstream OpenJDK does not manage them, and cannot vouch for. This is particularly important when it comes to conformance and security.
ja_jp: Mandrelは、標準のOpenJDKプロジェクトを使用して、Oracle GraalVM CEとは少し違った形で構築されています。これは、Oracleが独自のGraalVMダウンロードを構築するために使用するOpenJDKのバージョンに追加したいくつかの小さな機能強化から利益を得られないことを意味します。アップストリームのOpenJDKはそれらを管理しておらず、保証することができないため、このような機能強化は省略されています。これは、規格適合性とセキュリティーに関しては特に重要です。

source: Mandrel is built slightly differently to Oracle GraalVM CE, using the standard OpenJDK project. This means that it does not profit from a few small enhancements that Oracle have added to the version of OpenJDK used to build their own GraalVM downloads. This enhancements are omitted because upstream OpenJDK does not manage them, and cannot vouch for. This is particularly important when it comes to conformance and security.
ja_jp: Mandrelは、標準のOpenJDKプロジェクトを使用して、Oracle GraalVM CEとは少し違った形で構築されています。これは、Oracleが独自のGraalVMダウンロードを構築するために使用するOpenJDKのバージョンに追加したいくつかの小さなエクステンションから利益を得られないことを意味します。アップストリームのOpenJDKはそれらを管理しておらず、保証することができないため、このような機能強化は省略されています。これは、規格適合性とセキュリティーに関しては特に重要です。

source: Mandrel is recommended for building native executables that target Linux containerized environments. This means that Mandrel users are encouraged to use containers to build their native executables. If you are building native executables for macOS on amd64/x86, you should consider using Oracle GraalVM instead, because Mandrel does not currently target this platform. Building native executables directly on bare metal Linux, macOS (on M processors), or Windows is possible, with details available in the https://github.com/graalvm/mandrel/blob/default/README.md[Mandrel README] and https://github.com/graalvm/mandrel/releases[Mandrel releases].
ja_jp: Mandrel は、Linux コンテナー環境をターゲットとするネイティブ実行ファイルのビルドに推奨されます。つまり、Mandrel ユーザーは、ネイティブ実行ファイルのビルドにコンテナーを使用することが推奨されます。amd64/x86 上の macOS 用にネイティブ実行ファイルをビルドする場合は、Mandrel が現在このプラットフォームをターゲットにしていないため、代わりに Oracle GraalVM の使用を検討してください。ベアメタル Linux、macOS (M プロセッサー)、または Windows 上で直接ネイティブ実行ファイルをビルドすることも可能です。詳細は https://github.com/graalvm/mandrel/blob/default/README.md[Mandrel README] および https://github.com/graalvm/mandrel/releases[Mandrel リリース] で確認できます。

source: Mandrel is recommended for building native executables that target Linux containerized environments. This means that Mandrel users are encouraged to use containers to build their native executables. If you are building native executables for macOS, you should consider using Oracle GraalVM instead, because Mandrel does not currently target this platform. Building native executables directly on bare metal Linux or Windows is possible, with details available in the https://github.com/graalvm/mandrel/blob/default/README.md[Mandrel README] and https://github.com/graalvm/mandrel/releases[Mandrel releases].
ja_jp: Mandrelは現在のところ、Linuxのコンテナ化された環境をターゲットとしたネイティブ実行可能ファイルのビルドにのみ推奨されています。つまり、Mandrelユーザーは、コンテナを使用してネイティブ実行可能ファイルを構築することが推奨されます。macOS用のネイティブ実行可能ファイルをビルドする場合、Mandrelは現在そのプラットフォームをターゲットにしていないため、代わりにOracle GraalVMの使用を検討するべきです。ベアメタルのLinux上で直接ネイティブ実行可能ファイルをビルドすることも可能です。詳細は https://github.com/graalvm/mandrel/blob/default/README.md[Mandrel README] and https://github.com/graalvm/mandrel/releases[Mandrel のリリース]を参照してください。

source: Mandrel or GraalVM installed and xref:building-native-image.adoc#configuring-graalvm[configured appropriately]
ja_jp: MandrelまたはGraalVMがインストールされ、 link:building-native-image.html#configuring-graalvm[適切に設定されていること]

source: Mandrel releases are built from a code base derived from the upstream Oracle GraalVM CE code base, with only minor changes but some significant exclusions that are not necessary for Quarkus native apps. They support the same capabilities to build native executables as Oracle GraalVM CE, with no significant changes to functionality. Notably, they do not include support for polyglot programming. The reason for these exclusions is to provide a better level of support for the majority of Quarkus users. These exclusions also mean Mandrel offers a considerable reduction in its distribution size when compared with Oracle GraalVM CE/EE.
ja_jp: Mandrel のリリースは、アップストリームのOracle GraalVM CEコードベースから派生したコードベースから構築されており、わずかな変更しか行われていませんが、Quarkusネイティブアプリには必要ない重要な除外事項がいくつかあります。これらのリリースは、Oracle GraalVM CEと同じ機能をサポートしており、機能に大きな変更はありません。特筆すべきは、多言語プログラミングのサポートが含まれていないことです。これらの除外の理由は、大多数のQuarkusユーザーにより良いレベルのサポートを提供するためです。また、これらの除外は、Oracle GraalVM CE/EEと比較して、Mandrelの配布サイズが大幅に縮小されていることを意味しています。

source: Manipulate cached and binary data with the `value` group
ja_jp: `value` グループを使用したキャッシュされたデータとバイナリーデータの操作

source: Manipulation of the returned HTTP headers and status code is not possible via `RestMulti.fromUniResponse` because when returning SSE responses the headers and status code cannot be delayed until the response becomes available.
ja_jp: SSE 応答を返す場合、応答が利用可能になるまでヘッダーとステータスコードを遅延させることはできないため、返された HTTP ヘッダーとステータスコードを `RestMulti.fromUniResponse` 経由で操作できません。

source: Manual AOT file generation
ja_jp: 手動による AOT ファイル生成

source: Manual Baggage propagation
ja_jp: 手動 Baggage 伝播

source: Manual Context Propagation
ja_jp: 手動コンテキスト伝播

source: Manual Span
ja_jp: 手動スパン

source: Manual instrumentation
ja_jp: 手動計装

source: Manual propagation can be implemented for those clients if there is a way to ship metadata containing the OpenTelemetry context with the message or request.
ja_jp: OpenTelemetry コンテキストを含むメタデータをメッセージまたはリクエストとともに送信する方法がある場合、これらのクライアントに対して手動伝播を実装できます。

source: Manual registration is sometimes handy but it's also possible to register a template locator using `EngineBuilder.addLocator()`. This locator is used whenever the `Engine.getTemplate()` method is called and the engine has no template for a given id stored in the cache. The locator is responsible to use the correct character encoding when reading the contents of a template.
ja_jp: 手動での登録が便利な場合もありますが、 `EngineBuilder.addLocator()` を使用してテンプレートロケータを登録することも可能です。 このロケーターは、 `Engine.getTemplate()` メソッドが呼び出され、エンジンがキャッシュに保存されている指定された ID のテンプレートがない場合に使用されます。 ロケーターは、テンプレートの内容を読み込むときに正しい文字エンコーディングを使用する責任があります。

source: Manual setup
ja_jp: 手動セットアップ

source: Manual topic-partition assignment
ja_jp: topic-partition の手動割り当て

source: Manually
ja_jp: 手動で

source: Manually entering the service paths is not ideal, so please see the xref:test-with-swagger-graphql[Test with Swagger UI or GraphQL UI] section about enabling Swagger or GraphQL UI for testing the service with the access token already acquired by OIDC Dev UI.
ja_jp: 手動でサービスパスを入力するのは理想的ではありませんので、OIDC Dev UIですでに取得したアクセストークンを使ってサービスをテストするためのSwaggerまたはGraphQL UIの有効化については xref:test-with-swagger-graphql[Swagger UIまたはGraphQL UIによるテスト] の項をご覧ください。

source: Manually entering the service paths is not ideal. For information about enabling Swagger or GraphQL UI for testing the service with the access token already acquired by the OIDC Dev UI, see the <<test-with-swagger-graphql,Test with Swagger UI or GraphQL UI>> section.
ja_jp: サービスパスを手動で入力するのは理想的ではありません。 OIDC Dev UI ですでに取得済みのアクセストークンを使用してサービスをテストするために Swagger または GraphQL UI を有効にする方法については、<<test-with-swagger-graphql,Test with Swagger UI or GraphQL UI>> セクションを参照してください。

source: Manually setting the response
ja_jp: 手動でレスポンスを設定する

source: Manually triggering a reload and firing a `CertificateUpdatedEvent`:
ja_jp: 手動で再読み込みをトリガーし、 `CertificateUpdatedEvent` を起動します。

source: Manually using the micro base image
ja_jp: マイクロベースイメージを手動で使用する方法

source: Manually using the minimal base image
ja_jp: 最小限のベースイメージを手動で使用する方法

source: Manually, you can also test if the app is reachable:
ja_jp: 手動で、アプリが到達可能かどうかをテストすることもできます：

source: Many AI initiatives begin with robust data processing pipelines.
ja_jp: 多くのAIイニシアチブは、堅牢なデータ処理パイプラインから始まります。

source: Many Java applications rely on JVM system properties or client-specific configuration to enable proxy support. This approach can lead to duplicated configuration. This approach can also lead to inconsistent behavior across clients.
ja_jp: 多くの Java アプリケーションは、プロキシーサポートを有効にするために JVM システムプロパティーまたはクライアント固有の設定に依存しています。このアプローチは、設定の重複やクライアント間での一貫性のない動作につながる可能性があります。

source: Many Java libraries make heavy use of reflection to delay decisions to run-time. Quarkus aims to improve performance by moving logic to build time, reducing unnecessary dynamism. Extensions should aim to replace reflection with build-time code. This is enabled by xref:writing-extensions.adoc#scanning-deployments-using-jandex[Jandex], an "offline reflection" library. It may also be necessary to do some bytecode transformation of existing libraries.
ja_jp: 多くの Java ライブラリーは、判断を実行時まで遅らせるためにリフレクションを多用します。Quarkus は、ロジックをビルド時に移行し、不要な動性を排除することでパフォーマンスを向上させることを目指しています。エクステンションは、リフレクションをビルド時のコードに置き換えることを目指すべきです。これを可能にするのが「オフラインリフレクション」ライブラリーである xref:writing-extensions.adoc#scanning-deployments-using-jandex[Jandex] です。また、既存のライブラリーに対してバイトコード変換を行う必要がある場合もあります。

source: Many Quarkiverse extensions which are not in the Quarkus Platform also offer Dev Services.
ja_jp: Quarkus Platformに含まれていないQuarkiverseのエクステンションの多くも、Dev Servicesを提供しています。

source: Many Quarkus extensions expose Mutiny APIs. In this section, we use the MongoDB extension to illustrate how to use Mutiny.
ja_jp: 多くのQuarkusエクステンションがMutiny APIを公開しています。このセクションではMongoDBエクステンションを使用してMutinyの使用方法を説明します。

source: Many STM implementations allow "plain old language objects" to be made STM-aware with little or no changes to the application code. You can build, test and deploy applications without wanting them to be STM-aware and then later add those capabilities if they become necessary and without much development overhead at all.
ja_jp: 多くの STM 実装では、アプリケーションコードをほとんど変更することなく、「古い言語オブジェクト」を STM 対応させることができます。アプリケーションを STM に対応させずに、アプリケーションの構築、テスト、デプロイし、必要になっときに、開発のオーバーヘッドがほとんどない状態で、これらの機能を後で追加することができます。

source: Many libraries include compatibility layers to support multiple JDK versions. Typically, they rely on reflection to determine whether features like virtual threads are available.
ja_jp: 多くのライブラリーには、複数の JDK バージョンをサポートするための互換性レイヤーが含まれています。通常、これらは仮想スレッドなどの機能が利用可能かどうかを判断するためにリフレクションに依存しています。

source: Many methods, like REST endpoint methods or Vert.x Routes, are counted and timed by the micrometer extension out of the box.
ja_jp: REST エンドポイントメソッドや Vert.x ルートなどの多くのメソッドは、すぐに使用できる Micrometer エクステンションによってカウントされ、時間が計測されます。

source: Many projects that use data require connections to a relational database.
ja_jp: データを使用する多くのプロジェクトでは、リレーショナルデータベースへの接続が必要になります。

source: Many properties, which may look unusual or redundant in one specific deployment, have been added to address concrete requirements to support other deployments. Some important properties may have weaker default values to avoid breaking deployments whose providers do not support such properties by default, or provide limited or non-standard support.
ja_jp: 特定のデプロイメントでは異例または冗長に見える多くのプロパティーは、他のデプロイメントをサポートするための具体的な要件に対処するために追加されています。一部の重要なプロパティーは、プロバイダーがデフォルトでそのようなプロパティーをサポートしていない場合、または限定的もしくは非標準的なサポートしか提供していない場合に、デプロイメントが壊れるのを避けるため、デフォルト値が弱く設定されていることがあります。

source: Many usability enhancements have come into RESTEasy Reactive, such as retrieving all multipart parts.
ja_jp: RESTEasy Reactiveでは、マルチパートの部分をすべて取得できるようにするなど、多くのユーザビリティの改善が行われています。

source: Map LDAP groups to `SecurityIdentity` roles
ja_jp: LDAP グループを `SecurityIdentity` ロールにマップ

source: Map `SecurityIdentity` roles
ja_jp: `SecurityIdentity` ロールのマッピング

source: Map `SecurityIdentity` roles with shared permission
ja_jp: 共有権限を持つ `SecurityIdentity` ロールのマッピング

source: Map of extra string claims that must be added to the token
ja_jp: トークンに追加する必要がある追加の文字列クレームのマップ

source: Map of required string claims
ja_jp: 必須の文字列クレームのマッピング

source: Map the `admin` role to `Admin1` role. The `SecurityIdentity` will have both `admin` and `Admin1` roles.
ja_jp: `admin` ロールを `Admin1` ロールにマップします。 `SecurityIdentity` には `admin` ロールと `Admin1` ロールの両方が存在します。

source: Map the `standardRole` role to the application-specific `SecurityIdentity` role `user`.
ja_jp: `standardRole` ロールをアプリケーション固有の `SecurityIdentity` ロール `user` にマッピングします。

source: Map the `testclient` certificate CN (Common Name) to the `SecurityIdentity` role `admin`.
ja_jp: `testclient` 証明書の CN (共通名) を `SecurityIdentity` ロール `admin` にマッピングします。

source: Map to Scalar
ja_jp: スカラーへのマップ

source: Mapped Diagnostic Context Value
ja_jp: マッピングされた診断コンテキスト値

source: Mapped Diagnostic Context Values
ja_jp: マッピングされた診断コンテキスト値

source: Mapped Diagnostics Context Value
ja_jp: マップされた診断コンテキスト値

source: Mapped Diagnostics Context Values
ja_jp: マッピングされた診断コンテキスト値

source: Mapping Configuration to Objects
ja_jp: 設定をオブジェクトにマッピング

source: Mapping Protected Resources
ja_jp: 保護リソースのマッピング

source: Mapping a complex object to a Scalar type:
ja_jp: 複雑なオブジェクトをスカラー型にマッピングします。

source: Mapping an existing Scalar to another type:
ja_jp: 既存のスカラーを別のタイプにマッピングします。

source: Mapping certificate attributes to roles
ja_jp: 証明書属性をロールにマッピングする

source: Mapping configuration to objects
ja_jp: 設定をオブジェクトにマッピング

source: Mapping environment variables
ja_jp: 環境変数のマッピング

source: Mapping exposed ports
ja_jp: 公開ポートのマッピング

source: Mapping protected resources
ja_jp: 保護されたリソースのマッピング

source: Mapping token claims and `SecurityIdentity` roles
ja_jp: トークンクレームと `SecurityIdentity` ロールのマッピング

source: Mapping volumes from the Docker host's filesystem to the containers is handy to provide files like scripts or configuration, but also to preserve database data and reuse it after an application restart.
ja_jp: Dockerホストのファイルシステムからコンテナへのボリュームマッピングは、スクリプトや設定などのファイルを提供するのに便利ですが、データベースデータを保存してアプリケーション再起動後に再利用することもできます。

source: Mapping volumes into Dev Services for Database
ja_jp: Dev Services for Databaseにボリュームをマッピング

source: Mapping volumes will only work in Dev Services with a container-based database like PostgreSQL.
ja_jp: ボリュームのマッピングは、PostgreSQLのようなコンテナベースのデータベースを持つDev Servicesでのみ機能します。

source: Mapping: Includes application regions and Shared Object (.so) mappings for process
ja_jp: Mapping: プロセス用のアプリケーション領域と共有オブジェクト(.so)のマッピングを含む

source: Maps
ja_jp: マップ

source: Maps the policies archive to the `/opt/keycloak/providers/policies.jar` location inside the Keycloak container.
ja_jp: ポリシーアーカイブを Keycloak コンテナー内の `/opt/keycloak/providers/policies.jar` のロケーションにマップします。

source: MariaDB (container)
ja_jp: MariaDB (コンテナー)

source: MariaDB database connector
ja_jp: MariaDB データベースコネクター

source: Mark the recorder as optional, so it will only be invoked when in dev mode
ja_jp: レコーダーをオプションとしてマークし、開発モードの時にのみ起動されるようにします。

source: Mark your CDI bean method as `@Transactional` and the `EntityManager` will enlist and flush at commit.
ja_jp: CDI Beanメソッドに `@Transactional` を付けると `EntityManager` がトランザクション境界内に入りコミット時にフラッシュします。

source: Mark your CDI bean method as `@Transactional` so that a transaction is started or joined.
ja_jp: トランザクションが開始またはトランザクションに参加されるように、CDI Beanメソッドを `@Transactional` としてマークします。

source: Marked-up data
ja_jp: マークアップされたデータ

source: Marks an interceptor component.
ja_jp: インターセプターコンポーネントをマークします。

source: Marks the card as a favorite. Favorited cards are always displayed first in the Extensions view for easier access.
ja_jp: カードをお気に入りとしてマークします。お気に入りに追加されたカードは、より簡単にアクセスできるよう、エクステンションビューで常に最初に表示されます。

source: Marshalling
ja_jp: マーシャリング

source: Marshalling Java types
ja_jp: Java 型のマーシャリング

source: Marshalling your POJOs
ja_jp: POJO のマーシャリング

source: Mass indexer configuration object.
ja_jp: 一括インデクサー設定オブジェクト。

source: Massive performance without headaches
ja_jp: 頭痛の種にならない超パフォーマンス

source: Match beans where the package of the bean class is `org.acme`
ja_jp: Bean クラスのパッケージが `org.acme` である Bean に一致します。

source: Match beans where the package of the bean class starts with `org.acme`
ja_jp: Bean クラスのパッケージが `org.acme` で開始する Bean に一致します。

source: Match classes where the package starts with `org.acme`
ja_jp: パッケージが `org.acme` で始まるクラスを一致させる

source: Match classes with package `org.acme`
ja_jp: `org.acme` パッケージとクラスを一致させる

source: Match the fully qualified name of the bean class
ja_jp: bean クラスの完全修飾名と一致させる

source: Match the fully qualified name of the bean class or the bean class of the bean that declares the producer
ja_jp: Bean クラス、または producer を宣言する Bean の Bean クラスの完全修飾名に一致します。

source: Match the fully qualified name of the class
ja_jp: クラスの完全修飾名と一致させる

source: Match the simple name of the bean class
ja_jp: Bean クラスのシンプルな名前に一致します。

source: Match the simple name of the bean class or the bean class of the bean that declares the producer
ja_jp: Bean クラス、または producer を宣言する Bean の Bean クラスの単純名に一致します。

source: Match the simple name of the class
ja_jp: クラスのシンプルな名前に一致する

source: Matching a path but not a method
ja_jp: パスはマッチするがメソッドはマッチしない場合

source: Matching between the `@PermissionsAllowed` values and the `@PermissionChecker` value is based on string equality as shown in the example below:
ja_jp: `@PermissionsAllowed` 値と `@PermissionChecker` 値の一致は、次の例に示すように、文字列の等価性に基づいて行われます。

source: Matching by Name
ja_jp: 名前によるマッチング

source: Matching is always done on a longest path wins basis, less specific permission sets are not considered if a more specific one has been matched:
ja_jp: マッチングは常にロンゲストパス に基づいて行われ、より具体的なパーミッションセットがマッチした場合、それより具体的でないパーミッションセットは考慮されません。:
